{"pages":[{"title":"404","text":"","link":"/404.html"},{"title":"關於我","text":"歡迎來到 #4（Sharp Four），這裏是 Asakibi 的博客。請多指教。 本博客利用 Hexo 搭建，教程請參考 Easy Hexo，模板採用 icarus。","link":"/about/index.html"},{"title":"飞面释经 1：勿做道貌岸然之人","text":"在「飞面释经」系列中，一位在皈依和叛教来去之间的信徒，也就是我，为可能也在皈依和叛教来去之间的你，解释飞天意面神的精明之处。我将引用 The Gospel of the Flying Spaghetti Monster 的原文，将成为飞天意面神教教徒的基本非教义 the eight “I’d Really Rather You Didn’ts” 翻译为离成为世界通用语言仅一票之差的现代标准汉语传达给你。 I’d Really Rather You Didn’t Act Like A Sanctimonious, Holier-Than-Thou Ass When Describing My Noodly Goodness. If Some People Don’t Believe In Me, That’s Okay. Really, I’m Not That Vain. Besides, This Isn’t About Them So Don’t Change The Subject. (Gospel 15:10) 吾愿你们在描绘吾面神之善时，勿做道貌岸然、自命清高的傻屄。若部分子民不吾信，没关系。吾并不那么虚荣。再者，此与其无关，勿更易话题。(面经 15:10) 该文章有 繁體中文版 此文章不代表任何个人或团体所支持或反对的意见。一切责任由飞天意面神承担。 飞天意面神是全知全能的。 即使意大利面和肉丸常出现在不同的餐盘上，令祂四肢分离，还沾满了令人恶心¹ 的葱花和香菜，飞天意面神的各个组成部分，依旧凝视著每一位饭堂阿姨，督促他们平均分配圣餐——尽管对飞天意面神没有敬畏之心的异教徒的存在，令监察效果并不如祂意。祂也可以创造一块祂搬不动的大石头，但这块大石头只有最虔诚的信徒才能看见。但若你要问，祂能否创造一块祂看不见也搬不动的大石头，我想，飞天意面神的智慧已经给出答案：人不能够参透所有天机。祂可以洞察一切有机物和无机物的性情，但信徒没有祂那圣洁的生殖器。就我来说，我不是飞天意面神，我只是飞天意面神不算虔诚的信徒，我只能尽我所能，在吞下饭堂最后一口中式番茄烩意面时，心念祷告，领会飞天意面神的意图，并给你优质解答：我不知道。 作为神，祂不像异教的神那般高高在上，尽管祂拥有令人称奇的睪丸大小，足以在任何一座天堂的男生宿舍里来回走 62831853 次来炫耀一番。但神没有选择自命清高，而是俯视众生，并投百姓所好散播真善美。你可能没有意识到，普通的、丝毫不如鸡块甜酸酱的、即使快餐店多给几包你都不太想要的、宁愿吃原味薯条也不想把手弄脏因此根本他妈不会鸟的番茄酱是神的伟大创造，因为没有哪一个爱子民的神，不愿意将番茄的宿命引导向美味的酱汁。在番茄酱出现后，肯德基不放盐的薯条变得不再难吃²。飞天意面神的神性创造，也向进化论者的谬论打出了温柔而善意的铁拳，因为番茄酱催生了番茄这种水果的产生。 是的，进化论是人们编造的谎言。飞天意面神相信，每一个知晓天理，即不相信进化论的人的脑袋，都不会进化——因为进化等于谎言。但飞天意面神的信徒从未迫害那些信仰进化论的邪教徒，因为我们都遵循祂的教诲——每一位飞天意面神的追随者，都不应该自命不凡、高高在上，责骂、怒斥甚至用小拳拳锤那些信仰进化论的人。特别是在某个世俗国家，信仰进化论的生物系学生的前途已岌岌可危，这并非是受到了飞天意面神教信徒的打压，而是因为他们已经受到了来自飞天意面神的轻微警告，不再需要我们更多的冷嘲热讽和拳打脚踢。相反，飞天意面神教信徒会用爱与和平包容他们的存在。当他们在 QQ 空间、朋友圈或是微博发表与你没有什么关系但就是显得他们很不爽的任何有关学习和工作言论时，飞天意面神教信徒会敞开心扉，倾情拥抱，献上一句最真挚的祝福，并念出飞天意面神教信徒最虔诚的祷词： RAmen. 可见，飞天意面神是全知全能的，但祂不为此沾沾自喜，也告诫祂的子民，道貌岸然地布道的信徒都是傻屄。 学习俗：假日——飞面教徒的假日 在每一篇「飞面释经」中，我将为你介绍中华飞面神教中某一宗的独特习俗，为每一位有意在皈依和叛教来去之间的信徒提供参考。 HOLIDAY encompasses pretty much all of the big commercial holidays celebrated by the other religions. Holiday stretches over most of December and January, and it is interesting to consider how much this Pastafarian religion has spread over the last couple of years. In fact, many schools and businesses refer not to the “Christmas season,” but to the Pastafarian “Holiday season” instead. This is strong evidence of our rapid growth, and we feel that a special thanks should go out to Wal-Mart, who rejected the Christian phrase “Merry Christmas” in favor of the Pastafarian greeting “Happy Holidays.” We appreciate your support. (Gospel 21) 假日差不多囊括了其他宗教庆祝的所有大型商业假日。假日包含十二月和一月的大部分时间，而飞天面条神教在过去几年的传播可能令你感觉有趣。事实上，许多学校和公司不提「圣诞季」，而使用飞天面条神教的「假日季」。这是飞天面条神教扩张的有力证据。而且我们要对沃尔玛表达由衷的感谢，因为他们拒绝使用基督教短语「圣诞快乐」，而支持使用飞天面条神教的问候语「假日快乐」。感谢你们的支持。(面经 21) 有趣的是，在中国，人们更愿意欢度「春节」或是「国庆」——和宗教没有什么关系的节日，而非假日。因此，在许多中国学校和企业，假日的那些天并不放假。 那么中国的飞天面条神教信徒应当如何庆祝假日？请参考世界上大多数教徒的做法： 准备阶段：在假日其中一天的前一晚熬夜。在熬夜时，可以玩手机。在手机出现前，更古早的习俗是玩电脑、看电视之类。 假日开始：一觉睡到中午。 假日高潮：在家里的各种地方玩手机，或者根本懒得起床，在床上玩手机。 备选项：继续睡觉。 小提醒：不要忘记吃点东西，比如速食意面。 希望每一位飞天面条神教信徒都可以充实地度过属于自己的假日。 References 1 作者很喜欢。不喜欢香菜的基因应该跟它所有的等位基因道歉，并公开发表致歉声明。 2 作者觉得还行。不喜欢肯德基薯条的基因不需要道歉，但要须保证一定要尝尝肯德基薯条沾土豆泥。 3 有一个可爱的飞天意面神的矢量图标来自 Font Awesome。并推荐一个可以便捷查询 Font Awesome 图标的 网站。4 友情链接： 来去之间 - 微博。","link":"/FSMHermeneutics1/SC/index.html"},{"title":"Cocos2d-x 4.0 C++ 新手部分问题一览","text":"学校暑期的实训中，小组决定使用 Cocos2d-x 4.0 进行开发，制作一款「坦克大战」游戏。然而，网络上关于 Cocos2d-x 4.0 的教程寥寥可数，而旧版本的教程常常佔据搜索引擎前几页，使得新手开发者难以搜寻相关信息。同时，部分用户不规范转载，在内容上疏忽大意，并热衷于取含糊不清的标题，而平台对此监管不力，对搜索引擎使用者造成了困扰。笔者作为第一次接触 Cocos2d-x 4.0 的初学者，在游戏开发中也遇到了不少问题，经过不断查找解决思路，有了些许供新手入门的小提示，在此分享出来，以供后继者参考。须注意的是，笔者只是在短暂的时间内接触了 Cocos2d-x 4.0，既无及时的记录和反馈，也无深入的理解和思考，仅仅是不求甚解而已。 笔者的开发环境：Cocos2d-x 4.0 （C++），Tiled Map Editor 1.4.1，VS 2019，Windows 10。后来用到了 SQLite3。 该文章有 繁體中文版 文件路径 关于生成的工程目录，其源代码（.h 文件和 .cpp 文件）应该全部存放于 Classes 文件夹下，而图片、音效、地图等资源文件应全部存放于 Resources 文件夹下。而在代码中调用资源文件时，应将 Resources 看作资源根目录。例如，要调用 Resources\\img\\tank_1.png 这张图片作为精灵，应该使用如下语句： 1auto tank = Sprite::create(\"img\\tank_1.png\"); 其中 auto 关键字会帮助你依据函数返回值自动指定类型。事实上，这里的 tank 是一个 Sprite 指针（Sprite*）。 继承自 Scene 类的问题 在程序编写时，常常需要继承自 Scene 类，写出拥有自定义成员变量和成员函数的场景。但对于 Cocos2d-x，在子类不应该写构造函数，而应该用重构的父类的有关函数代替。比如，要写一个继承自 Scene 类的关卡选择类（LevelScene），可以模仿 Cocos2d-x 在创建工程时自带的 HelloWorldScene 类，依照以下步骤写出自己的一个类。 将 HelloWorldScene.h 和 HelloWorldScene.cpp 文件内容复制到 LevelScene 类 的有关文件中去。 修改类名、头文件名等为「levelScene」，使其编译可以通过。通俗地讲，就是把 LevelScene 文件中的 HelloWorldScene 都换为 LevelScene。 然后就可以在该子类的 init() 函数下写该场景的内容了。 至此，该类的大体框架已经构造完成了。在创建该类的对象时，只需调用 1auto levelScene = LevelScene::create(); 这里的 levelScene 是一个 LevelScene 指针。 然而，有时我们希望向 LevelScene 中传递参数，比如在 LevelScene 中添加一个 gameMode 属性，使得在创建 LevelScene 对象时可以初始化其成员的值。但我们并没有重写其构造函数，该怎麽传递参数呢？ 这时，就需要在以上的基础上修改 LevelScene 中的 createScene() 函数、create() 函数和 init() 函数。具体方法是： 重写 create() 函数。你可能会觉得奇怪，为什麽 HelloWorldScene 类找不到 create() 函数呢？我该到哪里去找 create() 的函数体？实际上，HelloWorldScene 的声明用宏定义 CREATE_FUNC(HelloWorldScene) 替代了 static HelloWorldScene* create()，因此，你应当把子类的 create() 写作以下形式： 123456789101112131415static __TYPE__* create(){ __TYPE__ *pRet = new(std::nothrow) __TYPE__(); if (pRet &amp;&amp; pRet-&gt;init()) { pRet-&gt;autorelease(); return pRet; } else { delete pRet; pRet = nullptr; return nullptr; }} 其中 __TYPE__ 要换为该类的类名。 接着，在 createScene() 函数、create() 函数和 init() 函数的声明中添加你想传递的参数。 同样地，在以上函数的函数体内的所有调用 createScene() 函数、create() 函数和 init() 函数之处修改为相应的参数。 也就是说，只要在该类上述所有三个函数的括号内加入所有你想传递的参数，就可以实现传参了。 继承自 Sprite 类的问题 对于 Sprite 类的子类，也採取相似的操作。然而，创建工程时并没有给出一个继承了 Sprite 类的子类的例子。那我们只能自己动手丰衣足食。如果仅仅是创造一个 Sprite 类的子类 Tank 类，而不向其中传入任何参数的话，你将需要： 用子类继承 Sprite 类。 子类中加入 create() 函数。 其格式可以照搬上面所写出的 create() 函数格式。 子类中加入 init() 函数（或者 initWithFile() 函数或 initWithTexture() 函数（统称为初始化函数），这取决于你想用哪种方式创建该子类精灵对象）。如果是採用 init() 函数作为初始化函数，那麽第二步的 create() 函数可以写成之前所说的宏定义。如果不採用 init() 函数，应该把之前的 create() 函数中的 init() 替换为你需要的函数，并添加对应的参数使得编译能够通过。 然后就可以在该子类的 init() 函数中添加该精灵初始化时的操作了。 如果你想传入参数，只需在上述函数声明和调用时添加参数即可。 Tiled Map Editor 相关问题关于某文件 479 行 compression 断言 导入地图文件后，发现弹出窗口报错，指出某文件 479 行 compression 断言错误： 1compression == \"\" || compression == \"gzip\" || compression == \"zlib\" 这是由于在 Tiled Map Editor 创建瓦片地图时，没有更改瓦片地图的压缩方式。Cocos2d-x 4.0 的瓦片地图只支持无压缩、gzip 压缩和 zlib 压缩，而 Tiled Map Editor 的默认压缩方式是「Z标准压缩」。 正确的修改方法，是在 Tiled Map Editor 中选择地图 -&gt; 地图属性，将「图块层格式」设定为「Base64 无压缩」「Base64 gzip压缩」或「Base64 zlib压缩」。 关于地图无法在游戏界面正常显示的问题 笔者在制作地图时，先创建了 .tsx 文件，然后以此作为图集来创作地图。但在导入地图，并将地图添加到某个场景的节点之后，地图在游戏界面上的显示非常奇怪。由于无现成的错误地图，只能凭印象描述一下：地图只显示有规律的色块，看得出轮廓但材质极度损害。 但若直接向 Tiled Map Editor 的「图块集」窗口中拖动图片文件，选择类型为「基于整张图块集图片」，并勾选「嵌入地图」，这样产生的瓦片是可以在 Cocos2d-x 中正常显示的。 关于 0x3DC 报错 在获取地图的一瓦片层并对该层上的瓦片进行操作时，出现在 CCGeometry.Cpp 第 46 行的一个断点指出： 1引发了异常: 读取访问权限冲突。other 是 0x3DC。 这是由于该瓦片层是空层。应当向该瓦片层添加瓦片，或者在对层操作之前加上一条条件判断语句，保证该指针不为空，如： 12if (!layer) return; 关于返回空指针 在遍历地图的所有瓦片时，你可能会遇到这样的问题： 1cocos2d::TMXLayer::getTileAt(...) 返回 nullptr。 这是由于你所选择的地方没有瓦片，应当在该语句的外部加上判断条件，筛掉空指针，如： 1234if (getTileAt(Vec(i, j))) { auto physicsBody = PhysicsBody::createBox(Size(tileSize)); getTileAt(Vec(i, j))-&gt;addComponent(physicsBody);} schedule 的选择器问题 在使用 schedule 或 scheduleOnce 时，你可能会对 schedule 函数内的参数感到迷惑。在网络上搜索相关信息，你多半会找到如下内容： 1this-&gt;schedule(schedule_selector(EnemyTank::turn), _dt); 但如此写会报错，编译器称其为「未定义标识符」。实际上，在 Cocos2d-x 4.0 中，使用的形式应当如下： 1this-&gt;schedule(CC_SCHEDULE_SELECTOR(EnemyTank::turn), _dt);","link":"/Cocos2dx/SC/index.html"},{"title":"随笔：雷","text":"「雨不下打么事雷。」 不遭遇了，人心也就无畏。多年前家里也曾遭过雷击，砸坏了许多电器，街上的修理匠都修不得。但近些日子，不曾发生过这种「惨案」，也就没什么戒备心，该吹电扇的还是吹着。直到外婆听见雷响，睡梦中爬起，悄悄关了一切。不见打开窗子，也就不凉快。 这样的场景已经见过不下十次。每次就像做噩梦一般，脑子里总会爬一些不好的东西出来。想到好友整日没回我信息罢，想到过一段时间又要停电了罢，总之心中惴惴不安，老是有杂草根除不掉，心里难得清净。直到他回复，说他生病了，我竟还舒了一口气；隔壁灯火还亮着，我便不再担心什么——若我真的是这么想，那我就算是半个豁达的小和尚。对于真实的我，不安的东西，一直就像是流动的熔岩，不停冒着泡，徐徐前行。而我又不想用针扎破这些熔岩上惹人生厌的红泡，因为它们此消彼长，春风吹又生。 人不能没有挂念的东西。有时候想，那些自嘲作没心没肺的人，心里到底悄悄埋了多少东西，以至于连自己都无法察觉？ 但雨终归还是下下来了。命运多舛到无处落脚的雷，终还是敌不过那雨的。 该文章有 繁體中文版 和 Latin Uhanhua pan","link":"/Essay1/SC/index.html"},{"title":"欢迎来到 #4","text":"欢迎来到 #4（Sharp Four），这里是 Asakibi 的博客。请多指教。 本博客利用 Hexo 搭建，教程请参考 Easy Hexo，模板采用 icarus。 该文章有 繁體中文版 和 Latin Uhanhua pan","link":"/HelloWorld/SC/index.html"},{"title":"Seipi: Lei","text":"‘Y pushia ta mosi lei.’ Pu tsauy niau, lenshin iejieu uuei. Tuonienchien jiali ietshen tsaukuo leiji, kaisangti shieulijiang teu shieupute. Tan jinshie ɯtsi, putshen fasenkuo tsetsong ‘tshan-an’, iejieu maute mo kaipeishin, kai tshuei fongsan ti haisi tshuei tau. Tsitau jiajia tintau leishiang, sueimongtsong phachi, chiauchiau kuanliau ichie. Puchien takhai tshuanghu, iejiu pu liangkhuai. Tseiangti tshangjin ijin jienkuo pushia sitshi. Meitshi jieuchiang tsuo uomong ipan, lautsi limien tsonghuei pha ishie puhauti tongshi chylai. Shiangtau hauieu tsenɯ meihuei uo shinshi pa, shiangtau kuo ituan sijien ieuiau thintienliau pa, tsongtsi shintsong tsueitsueipuan, lausi ieu tsatshau kenchy putiau, shinli nante chinjin. Tsitau tha hueifu, suo tha senpinliau, uo jinhai shyliau ikheu chi; kepi tenhuo hai liangtau, uo pien putsai tanshin mosi — io uo tsenti si tseme shiang, na uo jieusansi pankuo huotati shiauhuosang. Teiy tsensiti uo, puanti tongshi, itsi jieuchiangsi lieutongti iongien, putin mautau phau, shyshy chienshin. Ɯ uo ieu pushiang iong tsen tsapho tseshie iongiensang lelensen-ienti hongphau, in-uei thamen tshishiaupitsang, tshuenfongtshueiieusen. Len pulen maute kualienti tongshi. Ieusiheu shiang, nashie tsitshautsuo meishinmeifeiti len, shinli tauti chiauchiau mailiau jituo tongshi, itsiy lien tsiji teu ufa tshajio? Tan y tsongkuei haisi shia shialailiau. Minyntuotshuantau uchyluojioti lei, tsong haisi tipukuo la y ti. Kai uentsang ieu 繁體中文版 huo 简体中文版","link":"/Essay1/WH/index.html"},{"title":"Huan-in laitau #4","text":"Huan-in laitau #4 (Sharp Four, shiaphu fo), tseli si Asakibi-ti poke.Chin tuo tsijiau. Pen poke liiong Hexo tajien, jiautshen chin tshankhau Easy Hexo, mupan tshaiiong icarus. Kai uentsang ieu 繁體中文版 huo 简体中文版","link":"/HelloWorld/WH/index.html"}],"posts":[{"title":"Cities: Skylines 本地化嘗試","text":"該文章尚未編輯完成，請以最終版本為準。 最近遊玩 Cities: Skylines 简体中文版，發現遊戲內的翻譯問題較多，本地化工作做得並不到位。如出現以下問題： 姓名顛倒：英文版採用名（First Name）和姓（Last Name）的方法組合人名，而简体中文版雖沿用了這一方式，但將英文名設置為中文姓，將英文姓設置為中文名。 罕見名字：如有「奶奶」「大妈」「姨」「娘娘」等十分奇怪的名字。 名字男女共用：男女共用一套名字列表，這使得男性也會有「菲菲」「奶奶」「大妈」等名字，不符合實際情況。 非常規路名：以 Last Name/Residence Name/District Name + 路/大街/干道… 命名。如會出現「奶奶 干道」「山毛榉 街」等含不明原因空格的不符合中文表達習慣的道路名稱。 錯誤翻譯：如收費站的 charge 應譯作「收費」而非「充電」。 除以上問題以外，住宅和商業建築命名方式也有待改善。於是萌生了製作一款 mod 以使遊戲的翻譯符合中國人語言使用習慣的念頭。 在 Steam 創意工坊上搜尋到了 Steam 創意工坊 - Custom Names Lists mod。據作者的描述，通過創建 .namelist 和 .blacklist 文件（事實上是 xml 文件）作為白名單（用於添加翻譯）和黑名單（用於屏蔽原生翻譯），可以修改遊戲中居民和建築等的備選名稱列表。 該文章將在編輯完成後推出 简体中文版。 查看遊戲的原生翻譯 遊戲的語言文件在 {source}\\Files\\Locale 下。遊戲原生的翻譯可藉由 Steam 社區 - Localization Tool 查看。Custom Names Lists mod 也自帶導出功能。點擊遊戲中的 export 按鈕，桌面上會生成一個名為 complete.namelist 的文件。透過該文件可以查詢遊戲原生翻譯。 問題的解決1. 姓名问题 原生的語言文件採用 {0} 代表一個字符串中可供插入的位置，以組合字符串。如 NAME_MALE_FIRST（男性名字）的 1 個字符串是 李，NAME_MALE_LAST（男性姓氏）的第 2 個字符串是 {0}佳佳，兩者組合得姓名 李佳佳。 那麼要更正遊戲的中文姓名顛倒問題，應將 Last Name 設置為 姓{0}，將 First Name 設置為 名，經組合得 姓名。 此處設定姓氏男女通用，而姓名男女各不相同。 選取了 100 個姓氏（參考來源：《二〇一九年全国姓名报告》公安部户政管理研究中心）： 12345王 李 张 刘 陈 杨 黄 赵 吴 周 徐 孙 马 朱 胡 郭 何 林 高 罗郑 梁 谢 宋 唐 许 邓 韩 冯 曹 彭 曾 肖 田 董 潘 袁 蔡 蒋 余于 杜 叶 程 魏 苏 吕 丁 任 卢 姚 沈 钟 姜 崔 谭 陆 范 汪 廖石 金 韦 贾 夏 付 方 邹 熊 白 孟 秦 邱 侯 江 尹 薛 闫 段 雷龙 黎 史 陶 贺 毛 郝 顾 龚 邵 万 覃 武 钱 戴 严 欧 莫 孔 向 80 個男性名字（參考來源： 知乎 - chenqin 的回答）： 1234567金山 文山 贵 德明 文明 志明 玉祥 明 忠 志荣 永祥 国祥玉林 光明 正明 有才 树林 荣 林 斌 云龙 学仁 永平 春生志强 义 国良 永生 长生 志成 金明 永明 永昌 志刚 国平福林 金生 建国 国安 成 庆林 新民 军 平 玉山 玉明 建平连生 勇 金龙 和平 光荣 建明 建军 国强 刚 国庆 强 小平立新 辉 波 峰 涛 鹏 杰 磊 亮 超 飞 龙 浩 鑫 洋 宇 旭俊杰 博 阳 伟 41 個女性名字： 1234玉兰 秀兰 秀珍 桂兰 玉珍 淑珍 桂珍 淑兰 桂花 桂香 桂荣秀芳 春梅 玉梅 素珍 凤兰 秀梅 桂芳 秀云 萍 丽 玲 红 敏艳 小红 静 芳 燕 红梅 霞 娟 娜 海霞 海燕 丹 婷 婷婷 雪倩 莹 該知乎問題描述下的重名查詢網站（現已無法訪問）提供的數據只支持到 2005 年，故為與時俱進，添加了一些近两年來的新名字，如男性名字： 122018: 浩宇 浩然 宇轩 宇航 宇泽 梓豪 子轩 浩轩 宇辰 子豪2019: 铭泽 子墨 子睿 梓睿 女性名字： 122018: 梓涵 一诺 欣怡 诗涵 依诺 欣妍 雨桐 梓萱 可馨 佳怡2019: 佳琪 同時保留了 22 個原有的名字（皆為女性名字）： 12丹丹 佳佳 潇潇 倩如 雯雯 晓 珊 洁 翠花 思琪 琪 梦瑶 茹慧 菲菲 琪琪 薇 澜 诺 心 籁 媞 至此共有 100 個姓氏、94 個男性名字和 74 個女性名字。再使用 Word 中的文字替換功能，經一系列操作將空格和換行符轉換為如下格式： 12&lt;LocalizedString identifier=\"NAME_MALE_LAST\"&gt;王{0}&lt;/LocalizedString&gt;&lt;LocalizedString identifier=\"NAME_MALE_LAST\"&gt;李{0}&lt;/LocalizedString&gt; 並添加到 .namelist 文件中。同時在 .blacklist 文件中編輯，使得原生命名方式被覆蓋。 打開遊戲，發現人名已被修改。 以下施工中。 2. 道路名問題 遊戲採用 Last Name/Residence Name/District Name + 道路類型 方式命名道路，而通配符 {0} 被放置在道路類型名稱的字符串中。於是，要使路名有其獨特名字體系，需要刪除該通配符，修改為諸如「建设路」「人民大道」的字符串。 對應類型 後綴 street 街 road 路 avenue 大道 highway 快速路 此處選取了 66 個道路名（參考來源： 知乎 - 马骏的回答。去除了含有方位指向的名稱）： 123456建设 人民 文化 迎宾 朝阳 育才 振兴 光明 幸福 解放 团结公园 和平 新华 胜利 平安 向阳 青年 滨河 友谊 富民 前进文明 花园 健康 广场 创业 中山 中心 东风 中兴 新兴 民主新建 文昌 兴隆 永安 和谐 沿河 凤凰 利民 长安 红旗 兴业体育 学府 站前 永兴 府前 八一 新民 爱民 民生 新村 工农同心 曙光 教育 东兴 拥军 金山 市场 交通 祥和 创新 长青 3. 住宅區命名 遊戲中住宅區無論密度和建築等級一律使用後綴 住宅区，可改進如下： 對應類型 後綴 1 級低密度住宅區 屋、家、之家 2 級低密度住宅區 屋、家、之家 3 級低密度住宅區 屋、家、之家、别墅 4 級低密度住宅區 之家、别墅、府、庭、邸、馆、公馆、花园 5 級低密度住宅區 之家、别墅、府、庭、邸、馆、公馆、花园 1 級高密度住宅區 宿舍、楼 2 級高密度住宅區 宿舍、楼、住宅楼、居民楼、大楼 3 級高密度住宅區 宿舍、楼、住宅楼、居民楼、大楼 4 級高密度住宅區 大楼、公寓、苑、家园、大厦、广场 5 級高密度住宅區 大楼、公寓、苑、家园、大厦、广场 办公區 1写字楼、办公楼、总部、公司、科技、实验室","link":"/CitiesSkylinesChineseNameList/"},{"title":"隨筆：雷","text":"「雨不下打麼事雷。」 不遭遇了，人心也就無畏。多年前家裏也曾遭過雷擊，砸壞了許多電器，街上的修理匠都修不得。但近些日子，不曾發生過這種「慘案」，也就沒什麼戒備心，該吹電扇的還是吹著。直到外婆聽見雷響，睡夢中爬起，悄悄關了一切。不見打開窗子，也就不涼快。 這樣的場景已經見過不下十次。每次就像做噩夢一般，腦子裏總會爬一些不好的東西出來。想到好友整日沒回我訊息罷，想到過一段時間又要停電了罷，總之心中惴惴不安，老是有雜草根除不掉，心裏難得清淨。直到他回覆，說他生病了，我竟還舒了一口氣；隔壁燈火還亮著，我便不再擔心什麼——若我真的是這麼想，那我就算是半個豁達的小和尚。對於真實的我，不安的東西，一直就像是流動的熔岩，不停冒著泡，徐徐前行。而我又不想用針扎破這些熔岩上惹人生厭的紅泡，因爲它們此消彼長，春風吹又生。 人不能沒有掛念的東西。有時候想，那些自嘲作沒心沒肺的人，心裏到底悄悄埋了多少東西，以至於連自己都無法察覺？ 但雨終歸還是下下來了。命運多舛到無處落腳的雷，終還是敵不過那雨的。 該文章有 简体中文版 和 Latin Uhanhua pan","link":"/Essay1/"},{"title":"Cocos2d-x 4.0 C++ 新手部分問題一覽","text":"學校暑期的實訓中，小組決定使用 Cocos2d-x 4.0 進行開發，製作一款「坦克大戰」遊戲。然而，網絡上關於 Cocos2d-x 4.0 的教程寥寥可數，而舊版本的教程常常佔據搜索引擎前幾頁，使得新手開發者難以搜尋相關信息。同時，部分用戶不規範轉載，在内容上疏忽大意，並熱衷於取含糊不清的標題，而平台對此監管不力，對搜索引擎使用者造成了困擾。筆者作爲第一次接觸 Cocos2d-x 4.0 的初學者，在遊戲開發中也遇到了不少問題，經過不斷查找解決思路，有了些許供新手入門的小提示，在此分享出來，以供後繼者參考。須注意的是，筆者只是在短暫的時間内接觸了 Cocos2d-x 4.0，既無及時的記錄和反饋，也無深入的理解和思考，僅僅是不求甚解而已。 筆者的開發環境：Cocos2d-x 4.0 （C++），Tiled Map Editor 1.4.1，VS 2019，Windows 10。後來用到了 SQLite3。 該文章有 简体中文版 文件路徑 關於生成的工程目錄，其源代碼（.h 文件和 .cpp 文件）應該全部存放於 Classes 文件夾下，而圖片、音效、地圖等資源文件應全部存放於 Resources 文件夾下。而在代碼中調用資源文件時，應將 Resources 看作資源根目錄。例如，要調用 Resources\\img\\tank_1.png 這張圖片作爲精靈，應該使用如下語句： 1auto tank = Sprite::create(\"img\\tank_1.png\"); 其中 auto 關鍵字會幫助你依據函數返回值自動指定類型。事實上，這裏的 tank 是一個 Sprite 指針（Sprite*）。 繼承自 Scene 類的問題 在程序編寫時，常常需要繼承自 Scene 類，寫出擁有自定義成員變量和成員函數的場景。但對於 Cocos2d-x，在子類不應該寫構造函數，而應該用重構的父類的有關函數代替。比如，要寫一個繼承自 Scene 類的關卡選擇類（LevelScene），可以模仿 Cocos2d-x 在創建工程時自帶的 HelloWorldScene 類，依照以下步驟寫出自己的一個類。 將 HelloWorldScene.h 和 HelloWorldScene.cpp 文件内容複製到 LevelScene 類 的有關文件中去。 修改類名、頭文件名等爲「levelScene」，使其編譯可以通過。通俗地講，就是把 LevelScene 文件中的 HelloWorldScene 都換爲 LevelScene。 然後就可以在該子類的 init() 函數下寫該場景的内容了。 至此，該類的大體框架已經構造完成了。在創建該類的對象時，只需調用 1auto levelScene = LevelScene::create(); 這裏的 levelScene 是一個 LevelScene 指針。 然而，有時我們希望向 LevelScene 中傳遞參數，比如在 LevelScene 中添加一個 gameMode 屬性，使得在創建 LevelScene 對象時可以初始化其成員的值。但我們並沒有重寫其構造函數，該怎麽傳遞參數呢？ 這時，就需要在以上的基礎上修改 LevelScene 中的 createScene() 函數、create() 函數和 init() 函數。具體方法是： 重寫 create() 函數。你可能會覺得奇怪，爲什麽 HelloWorldScene 類找不到 create() 函數呢？我該到哪裏去找 create() 的函數體？實際上，HelloWorldScene 的聲明用宏定義 CREATE_FUNC(HelloWorldScene) 替代了 static HelloWorldScene* create()，因此，你應當把子類的 create() 寫作以下形式： 123456789101112131415static __TYPE__* create(){ __TYPE__ *pRet = new(std::nothrow) __TYPE__(); if (pRet &amp;&amp; pRet-&gt;init()) { pRet-&gt;autorelease(); return pRet; } else { delete pRet; pRet = nullptr; return nullptr; }} 其中 __TYPE__ 要換爲該類的類名。 接着，在 createScene() 函數、create() 函數和 init() 函數的聲明中添加你想傳遞的參數。 同樣地，在以上函數的函數體内的所有調用 createScene() 函數、create() 函數和 init() 函數之處修改爲相應的參數。 也就是説，只要在該類上述所有三個函數的括號内加入所有你想傳遞的參數，就可以實現傳參了。 繼承自 Sprite 類的問題 對於 Sprite 類的子類，也採取相似的操作。然而，創建工程時並沒有給出一個繼承了 Sprite 類的子類的例子。那我們只能自己動手豐衣足食。如果僅僅是創造一個 Sprite 類的子類 Tank 類，而不向其中傳入任何參數的話，你將需要： 用子類繼承 Sprite 類。 子類中加入 create() 函數。 其格式可以照搬上面所寫出的 create() 函數格式。 子類中加入 init() 函數（或者 initWithFile() 函數或 initWithTexture() 函數（統稱爲初始化函數），這取決於你想用哪種方式創建該子類精靈對象）。如果是採用 init() 函數作爲初始化函數，那麽第二步的 create() 函數可以寫成之前所説的宏定義。如果不採用 init() 函數，應該把之前的 create() 函數中的 init() 替換爲你需要的函數，並添加對應的參數使得編譯能夠通過。 然後就可以在該子類的 init() 函數中添加該精靈初始化時的操作了。 如果你想傳入參數，只需在上述函數聲明和調用時添加參數即可。 Tiled Map Editor 相關問題關於某文件 479 行 compression 斷言 導入地圖文件後，發現彈出窗口報錯，指出某文件 479 行 compression 斷言錯誤： 1compression == \"\" || compression == \"gzip\" || compression == \"zlib\" 這是由於在 Tiled Map Editor 創建瓦片地圖時，沒有更改瓦片地圖的壓縮方式。Cocos2d-x 4.0 的瓦片地圖只支持無壓縮、gzip 壓縮和 zlib 壓縮，而 Tiled Map Editor 的默認壓縮方式是「Z標準壓縮」。 正確的修改方法，是在 Tiled Map Editor 中選擇地圖 -&gt; 地圖屬性，將「圖塊層格式」設定爲「Base64 無壓縮」「Base64 gzip壓縮」或「Base64 zlib壓縮」。 關於地圖無法在遊戲界面正常顯示的問題 筆者在製作地圖時，先創建了 .tsx 文件，然後以此作爲圖集來創作地圖。但在導入地圖，並將地圖添加到某個場景的節點之後，地圖在遊戲界面上的顯示非常奇怪。由於無現成的錯誤地圖，只能憑印象描述一下：地圖只顯示有規律的色塊，看得出輪廓但材質極度損害。 但若直接向 Tiled Map Editor 的「圖塊集」窗口中拖動圖片文件，選擇類型爲「基於整張圖塊集圖片」，並勾選「嵌入地圖」，這樣產生的瓦片是可以在 Cocos2d-x 中正常顯示的。 關於 0x3DC 報錯 在獲取地圖的一瓦片層並對該層上的瓦片進行操作時，出現在 CCGeometry.Cpp 第 46 行的一個斷點指出： 1引发了异常: 读取访问权限冲突。other 是 0x3DC。 這是由於該瓦片層是空層。應當向該瓦片層添加瓦片，或者在對層操作之前加上一條條件判斷語句，保證該指針不爲空，如： 12if (!layer) return; 關於返回空指針 在遍歷地圖的所有瓦片時，你可能會遇到這樣的問題： 1cocos2d::TMXLayer::getTileAt(...) 返回 nullptr。 這是由於你所選擇的地方沒有瓦片，應當在該語句的外部加上判斷條件，篩掉空指針，如： 1234if (getTileAt(Vec(i, j))) { auto physicsBody = PhysicsBody::createBox(Size(tileSize)); getTileAt(Vec(i, j))-&gt;addComponent(physicsBody);} schedule 的選擇器問題 在使用 schedule 或 scheduleOnce 時，你可能會對 schedule 函數内的參數感到迷惑。在網絡上搜索相關信息，你多半會找到如下内容： 1this-&gt;schedule(schedule_selector(EnemyTank::turn), _dt); 但如此寫會報錯，編譯器稱其爲「未定義標識符」。實際上，在 Cocos2d-x 4.0 中，使用的形式應當如下： 1this-&gt;schedule(CC_SCHEDULE_SELECTOR(EnemyTank::turn), _dt);","link":"/Cocos2dx/"},{"title":"歡迎來到 #4","text":"歡迎來到 #4（Sharp Four），這裏是 Asakibi 的博客。請多指教。 本博客利用 Hexo 搭建，教程請參考 Easy Hexo，模板採用 icarus。 該文章有 简体中文版 和 Latin Uhanhua pan 歷次主題記載","link":"/HelloWorld/"},{"title":"飛麵釋經 1：勿做道貌岸然之人","text":"在「飛麵釋經」系列中，一位在皈依和叛教來去之間的信徒，也就是我，為可能也在皈依和叛教來去之間的你，解釋飛天意麵神的精明之處。我將引用 The Gospel of the Flying Spaghetti Monster 的原文，將成為飛天意麵神教教徒的基本非教義 the eight “I’d Really Rather You Didn’ts” 翻譯為離成為世界通用語言僅一票之差的現代標準漢語傳達給你。 I’d Really Rather You Didn’t Act Like A Sanctimonious, Holier-Than-Thou Ass When Describing My Noodly Goodness. If Some People Don’t Believe In Me, That’s Okay. Really, I’m Not That Vain. Besides, This Isn’t About Them So Don’t Change The Subject. (Gospel 15:10) 吾願你們在描繪吾麵神之善時，勿做道貌岸然、自命清高的傻屄。若部分子民不吾信，沒關係。吾並不那麼虛榮。再者，此與其無關，勿更易話題。(麵經 15:10) 該文章有 简体中文版 此文章不代表任何個人或團體所支持或反對的意見。一切責任由飛天意麵神承擔。 飛天意麵神是全知全能的。 即使意大利麵和肉丸常出現在不同的餐盤上，令祂四肢分離，還沾滿了令人惡心¹ 的蔥花和香菜，飛天意麵神的各個組成部分，依舊凝視著每一位飯堂阿姨，督促他們平均分配聖餐——儘管對飛天意麵神沒有敬畏之心的異教徒的存在，令監察效果並不如祂意。祂也可以創造一塊祂搬不動的大石頭，但這塊大石頭只有最虔誠的信徒才能看見。但若你要問，祂能否創造一塊祂看不見也搬不動的大石頭，我想，飛天意麵神的智慧已經給出答案：人不能夠參透所有天機。祂可以洞察一切有機物和無機物的性情，但信徒沒有祂那聖潔的生殖器。就我來說，我不是飛天意麵神，我只是飛天意麵神不算虔誠的信徒，我只能盡我所能，在吞下飯堂最後一口中式番茄燴意麵時，心念禱告，領會飛天意麵神的意圖，並給你優質解答：我不知道。 作為神，祂不像異教的神那般高高在上，儘管祂擁有令人稱奇的睪丸大小，足以在任何一座天堂的男生宿舍裏來回走 62831853 次來炫耀一番。但神沒有選擇自命清高，而是俯視眾生，並投百姓所好散播真善美。你可能沒有意識到，普通的、絲毫不如雞塊甜酸醬的、即使快餐店多給幾包你都不太想要的、寧願吃原味薯條也不想把手弄髒因此根本他媽不會鳥的番茄醬是神的偉大創造，因為沒有哪一個愛子民的神，不願意將番茄的宿命引導向美味的醬汁。在番茄醬出現後，肯德基不放鹽的薯條變得不再難吃²。飛天意麵神的神性創造，也向進化論者的謬論打出了溫柔而善意的鐵拳，因為番茄醬催生了番茄這種水果的產生。 是的，進化論是人們編造的謊言。飛天意麵神相信，每一個知曉天理，即不相信進化論的人的腦袋，都不會進化——因為進化等於謊言。但飛天意麵神的信徒從未迫害那些信仰進化論的邪教徒，因為我們都遵循祂的教誨——每一位飛天意麵神的追隨者，都不應該自命不凡、高高在上，責罵、怒斥甚至用小拳拳錘那些信仰進化論的人。特別是在某個世俗國家，信仰進化論的生物系學生的前途已岌岌可危，這並非是受到了飛天意麵神教信徒的打壓，而是因為他們已經受到了來自飛天意麵神的輕微警告，不再需要我們更多的冷嘲熱諷和拳打腳踢。相反，飛天意麵神教信徒會用愛與和平包容他們的存在。當他們在 QQ 空間、朋友圈或是微博發表與你沒有什麼關係但就是顯得他們很不爽的任何有關學習和工作言論時，飛天意麵神教信徒會敞開心扉，傾情擁抱，獻上一句最真摯的祝福，並念出飛天意麵神教信徒最虔誠的祷词： RAmen. 可見，飛天意麵神是全知全能的，但祂不為此沾沾自喜，也告誡祂的子民，道貌岸然地佈道的信徒都是傻屄。 學習俗：假日——飛麵教徒的假日 在每一篇「飛麵釋經」中，我將為你介紹中華飛麵神教中某一宗的獨特習俗，為每一位有意在皈依和叛教來去之間的信徒提供參考。 HOLIDAY encompasses pretty much all of the big commercial holidays celebrated by the other religions. Holiday stretches over most of December and January, and it is interesting to consider how much this Pastafarian religion has spread over the last couple of years. In fact, many schools and businesses refer not to the “Christmas season,” but to the Pastafarian “Holiday season” instead. This is strong evidence of our rapid growth, and we feel that a special thanks should go out to Wal-Mart, who rejected the Christian phrase “Merry Christmas” in favor of the Pastafarian greeting “Happy Holidays.” We appreciate your support. (Gospel 21) 假日差不多囊括了其他宗教慶祝的所有大型商業假日。假日包含十二月和一月的大部分時間，而飛天麵條神教在過去幾年的傳播可能令你感覺有趣。事實上，許多學校和公司不提「聖誕季」，而使用飛天麵條神教的「假日季」。這是飛天麵條神教擴張的有力證據。而且我們要對沃爾瑪表達由衷的感謝，因為他們拒絕使用基督教短語「聖誕快樂」，而支持使用飛天麵條神教的問候語「假日快樂」。感謝你們的支持。(麵經 21) 有趣的是，在中國，人們更願意歡度「春節」或是「國慶」——和宗教沒有什麼關係的節日，而非假日。因此，在許多中國學校和企業，假日的那些天並不放假。 那麼中國的飛天麵條神教信徒應當如何慶祝假日？請參考世界上大多數教徒的做法： 準備階段：在假日其中一天的前一晚熬夜。在熬夜時，可以玩手機。在手機出現前，更古早的習俗是玩電腦、看電視之類。 假日開始：一覺睡到中午。 假日高潮：在家裏的各種地方玩手機，或者根本懶得起床，在床上玩手機。 備選項：繼續睡覺。 小提醒：不要忘記吃點東西，比如速食意麵。 希望每一位飛天麵條神教信徒都可以充實地度過屬於自己的假日。 References 1 作者很喜歡。不喜歡香菜的基因應該跟它所有的等位基因道歉，並公開發表致歉聲明。 2 作者覺得還行。不喜歡肯德基薯條的基因不需要道歉，但要須保證一定要嘗嘗肯德基薯條沾土豆泥。 3 有一個可愛的飛天意麵神的矢量圖標來自 Font Awesome。並推薦一個可以便捷查詢 Font Awesome 圖標的 網站。4 友情鏈接： 來去之間 - 微博。","link":"/FSMHermeneutics1/"}],"tags":[{"name":"FSM","slug":"FSM","link":"/tags/FSM/"},{"name":"釋經學","slug":"釋經學","link":"/tags/%E9%87%8B%E7%B6%93%E5%AD%B8/"},{"name":"Cities: Skylines","slug":"Cities-Skylines","link":"/tags/Cities-Skylines/"},{"name":"l10n","slug":"l10n","link":"/tags/l10n/"},{"name":"Cocos2d-x","slug":"Cocos2d-x","link":"/tags/Cocos2d-x/"},{"name":"C++","slug":"C","link":"/tags/C/"}],"categories":[{"name":"Essay","slug":"Essay","link":"/categories/Essay/"},{"name":"Programming","slug":"Programming","link":"/categories/Programming/"},{"name":"Welcome","slug":"Welcome","link":"/categories/Welcome/"}]}